ERROR_MESSAGES = {
    400: "🤔 Упс! Щось не так з вашим запитом. Перевірте, чи всі дані введено правильно, і спробуйте ще раз!",
    401: "🔐 Здається, ви ще не зареєструвались! Будь ласка, зареєструйтесь, щоб продовжити.",
    403: "🚫 На жаль, у вас недостатньо прав для цієї дії.\nЗверніться до адміністратора, якщо вважаєте, що це помилка.",
    404: "🔍 Ой, я не знайшов того, що ви шукали.",
    422: "📄 Упс, щось не так з даними, які ви надали. Перевірте їх і спробуйте ще раз!",
    500: "😢 Ой, щось пішло не так на нашому боці. Ми вже працюємо над виправленням 🔧! Спробуйте трохи пізніше.",
    "default": "🤔 Щось пішло не так. Будь ласка, спробуйте пізніше або зверніться до підтримки."
}